tap "argoproj/tap"
tap "aws/tap"
tap "azure/kubelogin"
tap "bwhaley/ssmsh", "https://github.com/bwhaley/ssmsh"
tap "derailed/k9s"
tap "hacker1024/hacker1024"
tap "hashicorp/tap"
tap "homebrew/command-not-found"
tap "johanhaleby/kubetail"
tap "jstkdng/programs"
tap "kyverno/chainsaw", "https://github.com/kyverno/chainsaw"
tap "microsoft/git"
tap "minamijoyo/hcledit"
tap "neovim/neovim"
tap "norwoodj/tap"
tap "superbrothers/zsh-kubectl-prompt"
tap "vmware-tanzu/tanzu"
tap "weaveworks/tap"
# New file format for still image compression
brew "jpeg-xl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Record and share terminal sessions
brew "asciinema"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Bash shell debugger
brew "bashdb"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Linux/OSX/FreeBSD resource monitor
brew "bpytop"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Format codeblocks inside markdown and org documents
brew "cbfmt"
# CloudFlare's PKI toolkit
brew "cfssl"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# Library to render SVG files using Cairo
brew "librsvg"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Command-Line Tester
brew "clitest"
# CloudFormation Provider Development Toolkit
brew "cloudformation-cli"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Build control planes without needing to write code
brew "crossplane"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# More intuitive version of du in rust
brew "dust"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
# X11 implementation of the Remote Desktop Protocol (RDP)
brew "freerdp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# GNU Privacy Guard (OpenPGP)
brew "gnupg@1.4"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Java-based scripting language
brew "groovy"
# Like cURL, but for gRPC
brew "grpcurl"
# Vulnerability scanner for container images and filesystems
brew "grype"
# Kubernetes package manager
brew "helm"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Cost estimates for Terraform, Terragrunt, and CloudFormation
brew "infracost"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# KubeConfig Manager
brew "kubecm"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# OpenID Connect authentication plugin for kubectl
brew "kubelogin"
# Kubernetes Native Policy Management
brew "kyverno"
# LastPass command-line interface tool
brew "lastpass-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Powerful, lightweight programming language
brew "lua@5.4"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Cross platform, open source .NET development framework
brew "mono"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils", link: false
# Library for a binary-based efficient data interchange format
brew "msgpack"
# Open source relational database management system
brew "mysql-client"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk@21"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Perl compatible regular expressions library
brew "pcre"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Draw UML diagrams
brew "plantuml"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Monitor data's progress through a pipe
brew "pv"
# Generic syntax highlighter
brew "pygments"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Scans and monitors projects for security vulnerabilities
brew "snyk-cli"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Detect compliance and security violations across Infrastructure as Code
brew "terrascan"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Update version constraints in your Terraform configurations
brew "tfupdate"
# Code-search similar to ack
brew "the_silver_searcher"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Vi 'workalike' with many additional features
brew "vim"
# Vim script Language Lint
brew "vint"
# Simple terminal image viewer written in Rust
brew "viu"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# EC2 Instance Selector is a tool to filter EC2 instance types based on resource criteria
brew "aws/tap/ec2-instance-selector"
# A shell for the EC2 Parameter Store
brew "bwhaley/ssmsh/ssmsh"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Outputs current CPU core and package temperatures on macOS
brew "hacker1024/hacker1024/coretemp"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# Declarative Kubernetes end-to-end testing.
brew "kyverno/chainsaw/chainsaw"
# A command line editor for HCL
brew "minamijoyo/hcledit/hcledit"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Display information about the kubectl current context and namespace in zsh prompt.
brew "superbrothers/zsh-kubectl-prompt/zsh-kubectl-prompt"
# The core Tanzu command-line tool
brew "vmware-tanzu/tanzu/tanzu-cli"
# Command-line interface for 1Password
cask "1password-cli"
# Enable Windows-like alt-tab
cask "alt-tab"
# Control USB Cameras from an app
cask "cameracontroller"
# Enables developers to manage Confluent Cloud or Confluent Platform
cask "confluent-cli"
# Write, edit, and chat about your code with AI
cask "cursor"
# Disk usage utility
cask "disk-inventory-x"
# Window peeking utility app
cask "dockdoor"
# Developer platform
cask "dotnet-sdk"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Kubernetes IDE
cask "freelens"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Password manager
cask "lastpass"
# Open source build of Lens Kubernetes IDE
cask "openlens", args: { appdir: "~/Applications" }
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark-app"
# CLI for interacting with the Wiz platform
cask "wizcli"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Kerberos Ticket Autorenewal", id: 1246781916
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Universal Print", id: 6450432292
mas "WhatsApp", id: 310633997
go "sigs.k8s.io/controller-tools/cmd/controller-gen"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golang/mock/mockgen"
